server/load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Sustained Stress Test"
scenarios:
  - name: "Cache Check and SSE Sequence"
    flow:
      - get:
          url: "/api/scan/cache-check?url=example.com"
      - post:
          url: "/api/scan/start"
          json:
            url: "https://example.com"